test/loadtest/result.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking proca-dev.herokuapp.com (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        Cowboy
Server Hostname:        proca-dev.herokuapp.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
TLS Server Name:        proca-dev.herokuapp.com

Document Path:          /api
Document Length:        74 bytes

Concurrency Level:      500
Time taken for tests:   9.625 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      473000 bytes
Total body sent:        595000
HTML transferred:       74000 bytes
Requests per second:    103.90 [#/sec] (mean)
Time per request:       4812.378 [ms] (mean)
Time per request:       9.625 [ms] (mean, across all concurrent requests)
Transfer rate:          47.99 [Kbytes/sec] received
                        60.37 kb/s sent
                        108.36 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      284 1049 1248.7    635    7270
Processing:    74  469 849.8    166    6634
Waiting:       74  468 849.8    165    6633
Total:        415 1519 1555.1    856    9356

Percentage of the requests served within a certain time (ms)
  50%    856
  66%   1236
  75%   1770
  80%   1980
  90%   3470
  95%   5421
  98%   6768
  99%   7717
 100%   9356 (longest request)